import * as Yup from 'yup'

export const mobileSchema = Yup.object({
    name: Yup.string().required("نام موبایل الزامی میباشد").min(4, "نام موبایل نباید کمتر از 4 کاراکتر باشد").max(255, "نام موبایل نباید بیشتر از 255 کاراکتر باشد").trim(),
    price: Yup.string().required("قیمت موبایل الزامی میباشد").matches(/^\d+$/, "قیمت موبایل باید شامل اعداد باشد").min(4, "قیمت موبایل نباید کمتر از 4 کاراکتر باشد").max(9, "قیمت موبایل نباید بیشتر از  9 کاراکتر باشد").trim(),
    screen: Yup.string().required("اندازه صفحه موبایل الزامی میباشد").min(4, "اندازه صفحه موبایل نباید کمتر از 4 کاراکتر باشد").max(60, "اندازه صفحه موبایل نباید بیشتر ا 16 کاراکتر باشد"),
    brand: Yup.string().required("برند موبایل الزامی میباشد"),
    image: Yup.mixed().required("تصویر موبایل الزامی میباشد"),
    network: Yup.string().required("شبکه الزامی  میباشد").max(60, "شبکه نمیتواند بیشتر از60 کاراکتر باشد"),
    ram: Yup.string().required("رم الزامی می باشد").max(60, "رم نمیتواند بیشتر از 60 کاراکتر باشد"),
    dimensions: Yup.string().required("ابعاد موبایل الزامی میباشد").max(60, "ابعاد موبایل نباید بیشتر از 60 کاراکتر باشد"),
    weight: Yup.string().required("وزن موبایل الزامی میباشد").max(60, "وزن موبایل نباید بیشتر از 60 کاراکتر باشد"),
    simcart: Yup.string().required("سیمکارت موبایل الزامی میباشد").min(4, "سیمکارت موبایل نمیتواند کمتر از 4 کاراکتر باشد").max(60, "سیمکارت موبایل نمیتواند بیشتر از 60 کاراکتر باشد"),
    color: Yup.array().required("رنگ موبایل الزامی میباشد"),
    body: Yup.string().min(4, "اطلاعات بدنه نمیتواند کمتر از 8 کاراکتر باشد").max(500, "اطلاعات بدنه نمیتواند بیشتر از 500 کاراکتر باشد"),
    features: Yup.string().min(4, "ویژگی های خاص موبایل نمیتواند کمتر از 8 کاراکتر باشد").max(500, "ویژگی های خاص موبایل نمیتواند بیشتر از 500 کاراکتر باشد")
})

